
public class Main {
    public static void main(String[] args) {
        System.out.println("Введите число");
        Tasks.task1();
        System.out.println("Введите имя");
        Tasks.task2();
        Tasks.task3(new int[]{3, 2, 4, 5, 6, 9});
        //Задание 4
        /* [((())()(())]]*/
       /* Последовательность неправильная.
    1.[((())()(())]
    2.[[((())()(())]]
    3.[()(())()(())]]
    4.[(()())()(())]]
    5.[((()))()(())]]
    6.[((()))()(())]]
    7.[((()))()(())]]
    "["*/
    }


}
